# VSCode Extensions for Terraform Cloudflare Zero Trust Demo
# Last Updated: September 27, 2025

# Terraform and Infrastructure as Code
4ops.terraform
hashicorp.terraform
run-at-scale.terraform-doc-snippets

# Documentation and Diagrams
bierner.markdown-mermaid
pomdtr.excalidraw-editor
esbenp.prettier-vscode

# Templates and Configuration
cdpautsch.tpl
codelawd.env-intellisense
editorconfig.editorconfig
mkhl.direnv

# Cloud Providers
ms-azuretools.vscode-azureresourcegroups
amazonwebservices.aws-toolkit-vscode
googlecloudtools.cloudcode

# Python Support (for WARP routing scripts)
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance

# Shell and Scripting
mads-hartmann.bash-ide-vscode
timonwong.shellcheck

# Git and GitHub Integration
github.copilot
github.copilot-chat
github.remotehub
github.vscode-github-actions
ms-vscode.azure-repos
ms-vscode.remote-repositories

# UI and Theme
pkief.material-icon-theme

# JSON and YAML Support
redhat.vscode-yaml
